app/Models/Admin_model.php

SELECT *
FROM `super_admins`
WHERE `id` = 162
---
  public function get_admin_user_details($id)
{
    if (!is_numeric($id)) {
        throw new InvalidArgumentException("The 'id' parameter must be a numeric value.");
    }

    $query = $this->db->table('super_admins')->getWhere(['id' => (int) $id]);

SELECT COUNT(*) AS `numrows`
FROM `tbl_admin_request_balace_super_admin`
WHERE `admin_id` = '162'
---
  public function count_all_balanceamout_request_send_superadmin($admin_id)
{
    $builder = $this->db->table("tbl_admin_request_balace_super_admin");
    $builder->where('admin_id', $admin_id);
    return $builder->countAllResults();