app/Models/SpinnerStoppedNumber.php

    public function getLastTenResults($user_id)
{
    return $this->select(['numbers', 'mode_set'])
                ->where('user_id', $user_id) // Filter by user ID
                ->orderBy('id', 'DESC')
                ->limit(10)
                ->get()
                ->getResultArray();
---
SELECT `numbers`, `mode_set`
FROM `spinnerStoppedNumber`
WHERE `user_id` = '162'
ORDER BY `id` DESC
 LIMIT 10