app/Models/SuperAdmin_model.php

public function get_admin_by_id_super_admin(int $admin_id): ?object
{
    $query = $this->db->table('super_admins')->getWhere(['id' => $admin_id]);
---
SELECT *
FROM `super_admins`
WHERE `id` = 162