app/Models/Withdraw_model.php

SELECT *
FROM `super_admins`
WHERE `id` = 162
---
  public function get_admin_user_details($id)
{
    // Ensure $id is valid and sanitized
    if (!is_numeric($id)) {
        throw new InvalidArgumentException("The 'id' parameter must be a numeric value.");
    }

    // Query the database to get the admin user details
    $query = $this->db->table('super_admins')->getWhere(['id' => (int) $id]);

SELECT `tbl_player_user_withdraw_request_history`.`status` as `status_user`, `tbl_player_user_withdraw_request_history`.*, `super_admins`.`first_name`, `super_admins`.`last_name`, `tbl_player_user_withdraw_request_history`.`created_at`
FROM `tbl_player_user_withdraw_request_history`
JOIN `super_admins` ON `super_admins`.`id` = `tbl_player_user_withdraw_request_history`.`admin_id`
WHERE `tbl_player_user_withdraw_request_history`.`added_by` = '162'
ORDER BY `tbl_player_user_withdraw_request_history`.`request_id` DESC
 LIMIT 10
---
public function get_all_balanceamout_request_send_superadmin($admin_id, $limit, $offset)
{
    $builder = $this->db->table("tbl_player_user_withdraw_request_history");
    $builder->select('tbl_player_user_withdraw_request_history.status as status_user,tbl_player_user_withdraw_request_history.*, super_admins.first_name, super_admins.last_name, tbl_player_user_withdraw_request_history.created_at');
    $builder->join('super_admins', 'super_admins.id = tbl_player_user_withdraw_request_history.admin_id');
    $builder->where('tbl_player_user_withdraw_request_history.added_by', $admin_id);
    $builder->orderBy('tbl_player_user_withdraw_request_history.request_id', 'DESC');
    $builder->limit($limit, $offset);
    $query = $builder->get();